---
kind: other
id: Methods.T:Autodesk.Revit.DB.CurveByPointsArray
source: html/ee0260b1-9b07-0ba8-96d9-8c8c316c7d41.htm
---
# CurveByPointsArray Methods

Removes every curve from the array, rendering it empty.